<template>
  <div id="about">
    <h2>このサイトについて</h2>
    <p>今までいいねしてきた画像を一覧で見たいという個人的な気持ちで作成したサイトです。</p>
    <p>1回あたりの読み込みツイートは最大100件で、スクロールしていけばAPIの制限に引っかからない限り無限に過去のいいねを見に行けるはずです。</p>
    <p>imgと言いつつ動画にも対応しています。
      <br>あの日いいねした二次元画像を発掘しよう！
    </p>
    <h2>使い方</h2>
    <p>まず右上の「登録・ログイン」を押します。
      <br>そうするとTwitterの認証画面に飛ばされるので連携アプリを認証してください。
      <br>ログインしてない場合はログインしてください。
    </p>
    <p>使用する権限は読み取り権限のみです。</p>
    <p>読み込み件数は1回あたり100件、スクロールしていけば無限に過去に戻ることができます。
      <br>あとは表示される画像や動画たちを眺めるだけ！
    </p>
    <p>画像をクリックすると拡大表示ができます。また、そのさい下部にツイート文とユーザ名が表示されます。
      <br>さらにその画像をTwitterページで見たい場合はツイート文やユーザ名の下にリンクが貼ってあるのでそこから飛ぶことができます。
    </p>

    <h2>その他</h2>
    <p>
      当サイトはベータ版です。予告なく停止する場合があります。
      <br>利用者にいかなる損害が発生した場合も責任は負いかねます。
      <br>また、表示される各画像・動画は作成者・投稿者の著作物です。画像利用に関しては作成者・投稿者の指示に従ってください。
    </p>
    <p>
      何か問題がありましたら
      <a href="https://twitter.com/mnao_305" target="_blank">Twitter</a>か
      <a href="https://github.com/mnao305/imgFavtter/issues" target="_blank">GitHub</a>まで連絡いただけるとありがたいです。
    </p>
    <h2>リンク</h2>
    <p>
      <a href="https://twitter.com/mnao_305" target="_blank">Twitter</a>
      <br>
      <a href="https://github.com/mnao305/imgFavtter" target="_blank">GitHub</a>
    </p>
  </div>
</template>
